In [23]:
## set up the DB client library
!pip install psycopg2
!pip install sqlalchemy
!pip install python_dotenv

# you can only install once for python environment

Requirement already satisfied: psycopg2 in c:\users\user\anaconda3\lib\site-packages (2.9.9)
Requirement already satisfied: sqlalchemy in c:\users\user\anaconda3\lib\site-packages (2.0.30)
Requirement already satisfied: typing-extensions>=4.6.0 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (4.11.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy) (3.0.1)
Requirement already satisfied: python_dotenv in c:\users\user\anaconda3\lib\site-packages (1.0.1)

In [24]:
!pip uninstall python_dotenv

^C

In [16]:


# import libraries
from sqlalchemy import create_engine, text
from dotenv  import load_dotenv
import os
import pandas as pd

 
 # loading my credentials
load_dotenv(override=True)

True

In [12]:
# credentials
host = os.getenv('db_host')
username = os.getenv('db_username')
password = os.getenv('db_password')
port = os.getenv('db_port')
db_name = os.getenv('db_name')

In [13]:
## create an engine
database_url = f"postgresql+psycopg2://{username}:{password}@{host}:{port}/{db_name}"
engine = create_engine(database_url)

In [39]:
db_name

'Metrobank'

In [14]:
# creating a connection
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM employees"))
    rows = result.fetchall()
    for row in rows:
        print(row)

(1, 'Brenda Brady', 'Branch Manager', 3, datetime.date(2014, 7, 26))
(2, 'Amanda Rhodes', 'Cashier', 7, datetime.date(2020, 11, 11))
(3, 'Barbara Walton', 'Marketing executive', 8, datetime.date(2019, 10, 10))
(4, 'Cheryl Terry', 'Marketing executive', 4, datetime.date(2019, 8, 26))
(5, 'Sierra Holland', 'Marketing executive', 8, datetime.date(2013, 12, 16))
(6, 'Vincent Garcia', 'Branch Manager', 7, datetime.date(2021, 11, 17))
(7, 'Tyler Espinoza', 'Branch Manager', 2, datetime.date(2022, 7, 28))
(8, 'Sharon Johnson', 'Customer Service', 5, datetime.date(2020, 9, 21))
(9, 'Anthony Miller', 'Customer Service', 3, datetime.date(2017, 1, 15))
(10, 'Kevin Todd', 'Customer Service', 3, datetime.date(2019, 5, 31))
(11, 'Candice Johnson', 'Customer Service', 4, datetime.date(2014, 12, 23))
(12, 'Steven Gill', 'Cashier', 8, datetime.date(2016, 1, 28))
(13, 'Tammy Manning', 'Cashier', 9, datetime.date(2019, 8, 26))
(14, 'Cassandra Lindsey', 'Cashier', 10, datetime.date(2022, 8, 22))
(15, 'Sean Jacobs', 'Cashier', 8, datetime.date(2016, 4, 23))
(16, 'Daniel Thomas', 'Marketing executive', 10, datetime.date(2019, 4, 1))
(17, 'Samantha Harris', 'Marketing executive', 4, datetime.date(2017, 4, 21))
(18, 'Olivia Poole', 'Marketing executive', 2, datetime.date(2016, 4, 11))
(19, 'Casey Austin', 'Customer Service', 8, datetime.date(2018, 11, 23))
(20, 'Todd Miranda', 'Customer Service', 7, datetime.date(2022, 4, 8))

In [46]:
print(database_url)

postgresql+psycopg2://postgres:Aveb67%40>@localhost:5432/Metrobank

In [15]:
with engine.connect() as connection:
    result = connection.execute(text("SELECT * FROM employees"))
    rows = result.fetchmany(10)
    for row in rows:
        print(row)

(1, 'Brenda Brady', 'Branch Manager', 3, datetime.date(2014, 7, 26))
(2, 'Amanda Rhodes', 'Cashier', 7, datetime.date(2020, 11, 11))
(3, 'Barbara Walton', 'Marketing executive', 8, datetime.date(2019, 10, 10))
(4, 'Cheryl Terry', 'Marketing executive', 4, datetime.date(2019, 8, 26))
(5, 'Sierra Holland', 'Marketing executive', 8, datetime.date(2013, 12, 16))
(6, 'Vincent Garcia', 'Branch Manager', 7, datetime.date(2021, 11, 17))
(7, 'Tyler Espinoza', 'Branch Manager', 2, datetime.date(2022, 7, 28))
(8, 'Sharon Johnson', 'Customer Service', 5, datetime.date(2020, 9, 21))
(9, 'Anthony Miller', 'Customer Service', 3, datetime.date(2017, 1, 15))
(10, 'Kevin Todd', 'Customer Service', 3, datetime.date(2019, 5, 31))

In [17]:
## using pandas and the connection

with engine.connect() as connection:
    query  = "SELECT * FROM employees"
    df = pd.read_sql(query, connection)

In [18]:
df

    employeeid               name             position  branchid    hiredate
0            1       Brenda Brady       Branch Manager         3  2014-07-26
1            2      Amanda Rhodes              Cashier         7  2020-11-11
2            3     Barbara Walton  Marketing executive         8  2019-10-10
3            4       Cheryl Terry  Marketing executive         4  2019-08-26
4            5     Sierra Holland  Marketing executive         8  2013-12-16
5            6     Vincent Garcia       Branch Manager         7  2021-11-17
6            7     Tyler Espinoza       Branch Manager         2  2022-07-28
7            8     Sharon Johnson     Customer Service         5  2020-09-21
8            9     Anthony Miller     Customer Service         3  2017-01-15
9           10         Kevin Todd     Customer Service         3  2019-05-31
10          11    Candice Johnson     Customer Service         4  2014-12-23
11          12        Steven Gill              Cashier         8  2016-01-28
12          13      Tammy Manning              Cashier         9  2019-08-26
13          14  Cassandra Lindsey              Cashier        10  2022-08-22
14          15        Sean Jacobs              Cashier         8  2016-04-23
15          16      Daniel Thomas  Marketing executive        10  2019-04-01
16          17    Samantha Harris  Marketing executive         4  2017-04-21
17          18       Olivia Poole  Marketing executive         2  2016-04-11
18          19       Casey Austin     Customer Service         8  2018-11-23
19          20       Todd Miranda     Customer Service         7  2022-04-08

### SQL DDL ( Create, Alter, Drop, Truncate)  using Python DB Connection

In [22]:
sql_query = ''' 
                CREATE TABLE practice_table(
                id int,
                name text)          


            '''
with engine.connect() as connection:
    connection.execute(text(sql_query))
    connection.commit()

    print('TABLE CREATED SUCCESSFULLY!')

TABLE CREATED SUCCESSFULLY!

### SQL DML (Insert, Update, Delete) Using Python DB Cursor

In [29]:
sql_query = '''
                INSERT INTO Practice_table(id, name)
                VALUES (:id, :name)    
            '''
data = {'id': 1, 'name': 'Marian'}

# execute the insert
with engine.connect() as connection:
    connection.execute(text(sql_query), data)

    # commit
    connection.commit()

print('data successfully inserted')

data successfully inserted

In [31]:
## for multiple data
sql_query = '''
                INSERT INTO Practice_table(id, name)
                VALUES (:id, :name)    
            '''
data = [{'id': 2, 'name': 'Maria'},
{'id': 3, 'name': 'Lara'},
        {'id': 4, 'name': 'Mary'},
        {'id': 5, 'name': 'Nuria'},
        {'id': 6, 'name': 'Jarian'},
        {'id': 7, 'name': 'Musa'},
        {'id': 8, 'name': 'Lucy'}
]
# execute the insert
with engine.connect() as connection:
    connection.execute(text(sql_query), data)

    # commit
    connection.commit()

print('data successfully inserted')

data successfully inserted

In [32]:
# create a table named students(name, address, class, age) in the DB
sql_query = ''' 
                CREATE TABLE students(
                name text, 
                address varchar, 
                class varchar, 
                age int
                
                )          


            '''
with engine.connect() as connection:
    connection.execute(text(sql_query))
    connection.commit()

    print('TABLE CREATED SUCCESSFULLY!')

TABLE CREATED SUCCESSFULLY!

In [33]:
df = pd.read_csv('world_cup_matches.csv')

In [34]:
df.head()

,ID,Year,Date,Stage,Home Team,Home Goals,Away Goals,Away Team,Win Conditions,Host Team
0,1,1930,1930-07-13,Group stage,France,4,1,Mexico,NaN,False
1,2,1930,1930-07-13,Group stage,United States,3,0,Belgium,NaN,False
2,3,1930,1930-07-14,Group stage,Yugoslavia,2,1,Brazil,NaN,False
3,4,1930,1930-07-14,Group stage,Romania,3,1,Peru,NaN,False
4,5,1930,1930-07-15,Group stage,Argentina,1,0,France,NaN,False

In [38]:

df.to_sql('world_cup', engine, if_exists = 'replace', index = False)

900